###  Part # 1
  #### Terraform Format and Style 🖌``
  #### Terraform Initialization ⚙️``
  #### Terraform Plan 📖``
  <details><summary>Show Plan</summary>
  ```

  [command]/home/runner/work/_temp/68a64731-d162-4493-ba92-8800c94327a4/terraform-bin show -no-color tf.plan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat_gateway_eip will be created
  + resource "aws_eip" "nat_gateway_eip" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "App"   = "Web"
          + "Name"  = "Prod-nat-gateway-eip"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all             = {
          + "App"   = "Web"
          + "Name"  = "Prod-nat-gateway-eip"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc                  = true
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "App"   = "Web"
          + "Name"  = "Prod-igw"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all = {
          + "App"   = "Web"
          + "Name"  = "Prod-igw"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.my_nat_gateway will be created
  + resource "aws_nat_gateway" "my_nat_gateway" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "App"   = "Web"
          + "Name"  = "Prod-nat-gateway"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                           = {
          + "App"   = "Web"
          + "Name"  = "Prod-nat-gateway"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
    }

  # aws_route_table.private_subnets will be created
  + resource "aws_route_table" "private_subnets" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = (known after apply)
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "App"   = "Web"
          + "Name"  = "Prod-route-private-subnets"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all         = {
          + "App"   = "Web"
          + "Name"  = "Prod-route-private-subnets"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public_subnets will be created
  + resource "aws_route_table" "public_subnets" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "Prod-route-public-subnets"
        }
      + tags_all         = {
          + "Name" = "Prod-route-public-subnets"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private_route_table_association[0] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private_route_table_association[1] will be created
  + resource "aws_route_table_association" "private_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_route_table_association[0] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_route_table_association[1] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_route_table_association[2] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public_route_table_association[3] will be created
  + resource "aws_route_table_association" "public_route_table_association" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private_subnet[0] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Private-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Private-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private_subnet[1] will be created
  + resource "aws_subnet" "private_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Private-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Private-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[0] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-0"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[1] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-1"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[2] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-2"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-2"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet[3] will be created
  + resource "aws_subnet" "public_subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-3"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                                       = {
          + "App"   = "Web"
          + "Name"  = "Public-subnet-3"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "App"   = "Web"
          + "Name"  = "VPC Prod"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
      + tags_all                             = {
          + "App"   = "Web"
          + "Name"  = "VPC Prod"
          + "Owner" = "CAAacs"
          + "env"   = "Prod"
        }
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_route_table_ids = (known after apply)
  + private_subnets_ids     = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids       = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + vpc_id                  = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_eip.nat_gateway_eip will be created%0A  + resource "aws_eip" "nat_gateway_eip" {%0A      + allocation_id        = (known after apply)%0A      + association_id       = (known after apply)%0A      + carrier_ip           = (known after apply)%0A      + customer_owned_ip    = (known after apply)%0A      + domain               = (known after apply)%0A      + id                   = (known after apply)%0A      + instance             = (known after apply)%0A      + network_border_group = (known after apply)%0A      + network_interface    = (known after apply)%0A      + private_dns          = (known after apply)%0A      + private_ip           = (known after apply)%0A      + public_dns           = (known after apply)%0A      + public_ip            = (known after apply)%0A      + public_ipv4_pool     = (known after apply)%0A      + tags                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-nat-gateway-eip"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-nat-gateway-eip"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc                  = true%0A    }%0A%0A  # aws_internet_gateway.igw will be created%0A  + resource "aws_internet_gateway" "igw" {%0A      + arn      = (known after apply)%0A      + id       = (known after apply)%0A      + owner_id = (known after apply)%0A      + tags     = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-igw"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-igw"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id   = (known after apply)%0A    }%0A%0A  # aws_nat_gateway.my_nat_gateway will be created%0A  + resource "aws_nat_gateway" "my_nat_gateway" {%0A      + allocation_id                      = (known after apply)%0A      + association_id                     = (known after apply)%0A      + connectivity_type                  = "public"%0A      + id                                 = (known after apply)%0A      + network_interface_id               = (known after apply)%0A      + private_ip                         = (known after apply)%0A      + public_ip                          = (known after apply)%0A      + secondary_private_ip_address_count = (known after apply)%0A      + secondary_private_ip_addresses     = (known after apply)%0A      + subnet_id                          = (known after apply)%0A      + tags                               = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-nat-gateway"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-nat-gateway"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A    }%0A%0A  # aws_route_table.private_subnets will be created%0A  + resource "aws_route_table" "private_subnets" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = ""%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = (known after apply)%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-route-private-subnets"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all         = {%0A          + "App"   = "Web"%0A          + "Name"  = "Prod-route-private-subnets"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table.public_subnets will be created%0A  + resource "aws_route_table" "public_subnets" {%0A      + arn              = (known after apply)%0A      + id               = (known after apply)%0A      + owner_id         = (known after apply)%0A      + propagating_vgws = (known after apply)%0A      + route            = [%0A          + {%0A              + carrier_gateway_id         = ""%0A              + cidr_block                 = "0.0.0.0/0"%0A              + core_network_arn           = ""%0A              + destination_prefix_list_id = ""%0A              + egress_only_gateway_id     = ""%0A              + gateway_id                 = (known after apply)%0A              + ipv6_cidr_block            = ""%0A              + local_gateway_id           = ""%0A              + nat_gateway_id             = ""%0A              + network_interface_id       = ""%0A              + transit_gateway_id         = ""%0A              + vpc_endpoint_id            = ""%0A              + vpc_peering_connection_id  = ""%0A            },%0A        ]%0A      + tags             = {%0A          + "Name" = "Prod-route-public-subnets"%0A        }%0A      + tags_all         = {%0A          + "Name" = "Prod-route-public-subnets"%0A        }%0A      + vpc_id           = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private_route_table_association[0] will be created%0A  + resource "aws_route_table_association" "private_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.private_route_table_association[1] will be created%0A  + resource "aws_route_table_association" "private_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public_route_table_association[0] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public_route_table_association[1] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public_route_table_association[2] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_route_table_association.public_route_table_association[3] will be created%0A  + resource "aws_route_table_association" "public_route_table_association" {%0A      + id             = (known after apply)%0A      + route_table_id = (known after apply)%0A      + subnet_id      = (known after apply)%0A    }%0A%0A  # aws_subnet.private_subnet[0] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.5.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Private-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Private-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.private_subnet[1] will be created%0A  + resource "aws_subnet" "private_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.6.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Private-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Private-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_subnet[0] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1a"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.1.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-0"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_subnet[1] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1b"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.2.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-1"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_subnet[2] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1c"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.3.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-2"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-2"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_subnet.public_subnet[3] will be created%0A  + resource "aws_subnet" "public_subnet" {%0A      + arn                                            = (known after apply)%0A      + assign_ipv6_address_on_creation                = false%0A      + availability_zone                              = "us-east-1d"%0A      + availability_zone_id                           = (known after apply)%0A      + cidr_block                                     = "10.1.4.0/24"%0A      + enable_dns64                                   = false%0A      + enable_resource_name_dns_a_record_on_launch    = false%0A      + enable_resource_name_dns_aaaa_record_on_launch = false%0A      + id                                             = (known after apply)%0A      + ipv6_cidr_block_association_id                 = (known after apply)%0A      + ipv6_native                                    = false%0A      + map_public_ip_on_launch                        = false%0A      + owner_id                                       = (known after apply)%0A      + private_dns_hostname_type_on_launch            = (known after apply)%0A      + tags                                           = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-3"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                                       = {%0A          + "App"   = "Web"%0A          + "Name"  = "Public-subnet-3"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + vpc_id                                         = (known after apply)%0A    }%0A%0A  # aws_vpc.main will be created%0A  + resource "aws_vpc" "main" {%0A      + arn                                  = (known after apply)%0A      + cidr_block                           = "10.1.0.0/16"%0A      + default_network_acl_id               = (known after apply)%0A      + default_route_table_id               = (known after apply)%0A      + default_security_group_id            = (known after apply)%0A      + dhcp_options_id                      = (known after apply)%0A      + enable_dns_hostnames                 = (known after apply)%0A      + enable_dns_support                   = true%0A      + enable_network_address_usage_metrics = (known after apply)%0A      + id                                   = (known after apply)%0A      + instance_tenancy                     = "default"%0A      + ipv6_association_id                  = (known after apply)%0A      + ipv6_cidr_block                      = (known after apply)%0A      + ipv6_cidr_block_network_border_group = (known after apply)%0A      + main_route_table_id                  = (known after apply)%0A      + owner_id                             = (known after apply)%0A      + tags                                 = {%0A          + "App"   = "Web"%0A          + "Name"  = "VPC Prod"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A      + tags_all                             = {%0A          + "App"   = "Web"%0A          + "Name"  = "VPC Prod"%0A          + "Owner" = "CAAacs"%0A          + "env"   = "Prod"%0A        }%0A    }%0A%0APlan: 18 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + private_route_table_ids = (known after apply)%0A  + private_subnets_ids     = [%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + public_subnet_ids       = [%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A      + (known after apply),%0A    ]%0A  + vpc_id                  = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

  ```
  </details>
  *Pusher: @udamad024, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform - Staging`*